# используем официальный образ Go
FROM golang:1.22.0

# Устанавливаем текущий рабочий каталог контейнера
WORKDIR /app

# копируем файлы, которые используются для управления зависимостями
COPY go.mod go.sum ./

# загружаем зависимости
RUN go mod download

# копируем исходный код в контейнер
COPY . .

#строим Go приложение (при CGO_ENABLED=0 не работает, причину пока не поняла
#RUN GOOS=linux GOARCH=amd64 go build -o my_app .
RUN go build -o my_app . 

# устанавливаем переменные окружения 
ENV TODO_PASSWORD="123"
ENV TODO_DBFILE="./scheduler.db"


# веб-сервер будет слушать порт, если он указан в переменной окружения TODO_PORT,
# иначе по умолчанию будет использован порт 7540
EXPOSE ${TODO_PORT:-7540}


# определяем команду для запуска веб-сервера
CMD ["./my_app"]
